tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/system/controlDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	controlDict;
}
application	refineMesh2D;
startFrom	startTime;
startTime	0;
stopAt	endTime;
endTime	1.0;
deltaT	1.0;
writeControl	timeStep;
writeInterval	10.0;
purgeWrite	0;
timeFormat	general;
timePrecision	6;
writeFormat	ascii;
writePrecision	7;
writeCompression	uncompressed;
runTimeModifiable	true;
maxAlphaCo	0.5;
