tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/constant/polyMesh/blockMeshDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/polyMesh";
	object	blockMeshDict;
}
convertToMeters	1;
edges	
(
);
vertices	(
	( 0 0 0 )
	( 1 0 0 )
	( 1 1 0 )
	( 0 1 0 )
	( 0 0 0.1 )
	( 1 0 0.1 )
	( 1 1 0.1 )
	( 0 1 0.1 )
);
boundary	
(
	bottom
	{
		type wall;
		faces
		(
			(1 5 4 0)
		);
	}
	back
	{
		type empty;
		faces
		(
			(0 3 2 1)
		);
	}
	front
	{
		type empty;
		faces
		(
			(4 5 6 7)
		);
	}
	left
	{
		type wall;
		faces
		(
			(0 4 7 3)
		);
	}
	right
	{
		type wall;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type wall;
		faces
		(
			(3 7 6 2)
		);
	}

);
blocks	
(
	hex (0 1 2 3 4 5 6 7) (5 5 1) simpleGrading (1 1 1)
);
