tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/constant/LESProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	LESProperties;
}
printCoeffs	on;
LESModel	laminar;
turbulence	false;
filter	simple;
delta	cubeRootVol;
laminarCoeffs
{
}
cubeRootVolCoeffs
{
	deltaCoeff	1.0;
}
