tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/constant/RASProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	RASProperties;
}
printCoeffs	on;
RASModel	laminar;
turbulence	false;
