tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/constant/turbulenceProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	turbulenceProperties;
}
simulationType	RASModel;
