tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/constant/MRFProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	MRFProperties;
}
