tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/constant/porosityProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	porosityProperties;
}
