tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/constant/transportProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	transportProperties;
}
phases	(water oil);
sigma	sigma [1 0 -2 0 0 0 0] 0.07;
water
{
	nu	nu [0 2 -1 0 0 0 0] 1.0E-6;
	rho	rho [1 -3 0 0 0 0 0] 998.0;
	transportModel	Newtonian;
}
oil
{
	nu	nu [0 2 -1 0 0 0 0] 1.0E-5;
	rho	rho [1 -3 0 0 0 0 0] 1.0;
	transportModel	Newtonian;
}
