tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/0/U
FoamFile
{
	version	2.0;
	format	ascii;
	class	volVectorField;
	location	"0";
	object	U;
}

dimensions	[0 1 -1 0 0 0 0];

internalField	uniform (0.0 0.0 0.0);

boundaryField
{
	back
	{
		type	empty;
	}
	bottom
	{
		type	movingWallVelocity;
		value	uniform (0.0 0.0 0.0);
	}
	front
	{
		type	empty;
	}
	left
	{
		type	movingWallVelocity;
		value	uniform (0.0 0.0 0.0);
	}
	right
	{
		type	movingWallVelocity;
		value	uniform (0.0 0.0 0.0);
	}
	top
	{
		type	movingWallVelocity;
		value	uniform (0.0 0.0 0.0);
	}
}
