tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/0/p_rgh
FoamFile
{
	version	2.0;
	format	ascii;
	class	volScalarField;
	location	"0";
	object	p_rgh;
}

dimensions	[1 -1 -2 0 0 0 0];

internalField	uniform 0.0;

boundaryField
{
	back
	{
		type	empty;
	}
	bottom
	{
		type	fixedFluxPressure;
	}
	front
	{
		type	empty;
	}
	left
	{
		type	fixedFluxPressure;
	}
	right
	{
		type	fixedFluxPressure;
	}
	top
	{
		type	fixedFluxPressure;
	}
}
