tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/system/fvSchemes
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	fvSchemes;
}
ddtSchemes
{
	default	Euler;
}
gradSchemes
{
	default	Gauss linear;
}
divSchemes
{
	default	Gauss upwind;
	div(rhoPhi,U)	Gauss upwind;
	div(phirb,alpha)	Gauss interfaceCompression;
	div(phi,alpha)	Gauss vanLeer;
	div(R)	Gauss linear;
	div((muEff*dev(T(grad(U)))))	Gauss linear;
}
laplacianSchemes
{
	default	Gauss linear corrected;
}
interpolationSchemes
{
	default	linear;
}
snGradSchemes
{
	default	corrected;
}
fluxRequired
{
	default	no;
	p_rgh	;
	pcorr	;
	"alpha.*"	;
}
