tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/system/setFieldsDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	setFieldsDict;
}
regions	(
	boxToCell
	{
		box	(0.4 0.4 0) (0.6 0.6 0.1);
		fieldValues	(
			volScalarFieldValue alpha.water 1.0
		);
	}
);
