tutorials/mesh/adaptiveLocalMeshRefinement2D/RubiksCube/system/surfaceFeatureExtractDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	surfaceFeatureExtractDict;
}
